Revit 2027 API
Blend.SetVertexConnectionMap Method
Sets the mapping between the vertices in the top and bottom profiles.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetVertexConnectionMap(
	VertexIndexPairArray vertexMap
)
Public Sub SetVertexConnectionMap (
	vertexMap As VertexIndexPairArray
)
public:
void SetVertexConnectionMap(
	VertexIndexPairArray^ vertexMap
)
member SetVertexConnectionMap :
        vertexMap : VertexIndexPairArray -> unit
Parameters
vertexMap VertexIndexPairArray
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"vertexMap"-is null.
ArgumentException |  Thrown if the input argument-"vertexMap"-is empty.
InvalidOperationException |  Thrown when the document failed to regenerate.
See Also
Reference
Blend Class
Autodesk.Revit.DB Namespace